Repository: turris-cz/reforis-remote-devices
Catalog: reforis_remote_devices/translations/*/LC_MESSAGES/messages.po
Languages: cs, fr, hu, ru, sk

source: Remote Devices
cs: Vzdálená zařízení
fr: Appareils à distance
hu: Távoli eszközök
ru: Удаленные устройства
sk: Vzdialené zariadenia

source: Add Device
cs: Přidat zařízení
fr: Ajouter un appareil
hu: Eszköz hozzáadása
ru: Добавить устройство
sk: Pridať zariadenie

source: Upload token file generated by the device you want to control remotely.
cs: Nahrajte soubor s tokenem vygenerovaný na zařízení, které chcete vzdáleně ovládat.
fr: Téléversez le fichier de jeton généré par l'appareil que vous voulez contrôler à distance.
hu: Töltse fel a távvezérelni kívánt eszköz által létrehozott token fájlt.
ru: Загрузите файл токена, созданный устройством, которым вы хотите управлять удаленно.
sk: Nahrať súbor s tokenom vygenerovaný zariadením, ktoré sa má vzdialene ovládať.

source: Choose token file...
cs: Vybrat soubor s tokenem...
fr: Choisissez le fichier du jeton…
ru: Выберите файл токена...
sk: Vybrať súbor s tokenom...

source: Upload token
cs: Nahrát token
fr: Télécharger un jeton de sécurité
hu: Token feltöltése
ru: Загрузить токен
sk: Nahrať token

source: The file is too big. The maximum size is 1 MB.
cs: Soubor je příliš velký. Maximální velikost je 1 MB.
fr: Le fichier est trop volumineux. La taille maximale est de 1 Mo.
hu: A fájl túl nagy. A maximális méret 1 MB.
ru: Файл слишком большой. Максимальный размер - 1 Мб.
sk: Súbor je príliš veľký. Maximálna veľkosť je 1 MB.

source: The filename must be at least 1 and at most 50 characters long.
cs: Název souboru musí mít délku 1 až 50 znaků.
fr: Le nom du fichier doit comporter au moins 1 et au plus 50 caractères.
hu: A fájlnévnek legalább 1 és legfeljebb 50 karakter hosszúnak kell lennie.
ru: Имя файла должно быть от 1 до 50 символов.
sk: Názov súboru musí mať najmenej 1 a najviac 50 znakov.

source: The filename can contain only alphanumeric characters, dots, dashes, and underscores.
cs: Název souboru může obsahovat jen alfanumerické znaky, tečky, spojovníky a podtržítka.
fr: Le nom du fichier peut seulement contenir des caractères alphanumériques, des points, des tirets et des tirets bas.
hu: A fájlnév csak alfanumerikus karaktereket, pontokat, kötőjeleket és aláhúzásokat tartalmazhat.
ru: Имя файла может содержать только буквенно-цифровые символы, точки, дефисы и подчеркивания.
sk: Názov súboru môže obsahovať len písmená, číslice, bodky, pomlčky a podčiarkovník.

source: Devices List
cs: Seznam zařízení
fr: Liste des appareils
hu: Eszközök listája
ru: Список устройств
sk: Zoznam zariadení

source: No devices added yet.
cs: Zatím nepřidána žádná zařízení.
fr: Aucun périphérique ajouté pour le moment.
hu: Még nincs hozzáadva eszköz.
ru: Устройства еще не добавлены.
sk: Nie sú pridané žiadne zariadenia.

source: ID
hu: Azonosító
ru: Идентификатор

source: Name
cs: Název
fr: Nom
hu: Név
ru: Имя
sk: Názov

source: Status
cs: Stav
fr: Statut
hu: Állapot
ru: Статус
sk: Stav

source: Managed
cs: Spravováno
fr: Géré
hu: Kezelt
ru: Управляемое
sk: Spravované

source: Delete
cs: Smazat
fr: Supprimer
hu: Törlés
ru: Удалить
sk: Vymazať

source: Yes
cs: Ano
fr: Oui
hu: Igen
ru: Да
sk: Áno

source: No
cs: Ne
fr: Non
hu: Nem
ru: Нет
sk: Nie

source: Started
cs: Spuštěno
fr: Démarré
hu: Elindult
ru: Стартовало
sk: Spustené

source: Running
cs: Běží
fr: En cours d'exécution
hu: Fut
ru: Запущено
sk: Prebieha

source: Exited
cs: Ukončeno
fr: Quitter
hu: Kilépett
ru: Останавливается
sk: Ukončené

source: Unknown status
cs: Neznámý stav
fr: Statut inconnu
hu: Ismeretlen állapot
ru: Неизвестный статус
sk: Neznámy stav

source: Devices
cs: Zařízení
fr: Appareils
hu: Eszközök
ru: Устройства
sk: Zariadenia

source: You can set up other Turris routers to be managed remotely by this device.
cs: Můžete nastavit jiné routery Turris, aby byly vzdáleně spravovány z tohoto zařízení.
fr: Vous pouvez configurer d'autres routeurs Turris pour qu'ils soient gérés à distance par cet appareil.
hu: Beállíthat más Turris útválasztókat is, amelyeket ez az eszköz távolról kezel.
ru: Вы можете настроить другие маршрутизаторы Turris для удаленного управления этим устройством.
sk: Môžete nastaviť iné routery Turris, aby sa dali vzdialene spravovať z tohoto zariadenia.

source: To authorize your router, you will need a token file that can be obtained with the "Remote Access" plugin on the target device.
cs: K autorizaci routeru budete potřebovat token, který lze získat v pluginu "Vzdálený přístup" na cílovém zařízení.
fr: Pour autoriser votre routeur, vous aurez besoin d'un fichier de jeton qui peut être obtenu avec le module « Accès à distance » sur l'appareil cible.
hu: Ahhoz, hogy engedélyezze az útválasztót szüksége lesz egy tokenre, amely a céleszköz "Remote Access" bővítményével szerezhető be.
ru: Для авторизации роутера вам понадобится файл токена, который можно получить с помощью плагина «Удаленный доступ» на целевом устройстве.
sk: Na autorizáciu vášho routera je potrebný súbor s tokenom, ktorý sa dá získať v plugine „Vzdialený prístup“ na cieľovom zariadení.

source: Custom name
ru: Выбранное Имя пользователя

source: Edit name
cs: Upravit název
fr: Renommer
hu: Név szerkesztése
ru: Редактировать имя
sk: Upraviť názov

source: Save changes
ru: Сохранить изменения

source: Discard changes
ru: Отменить изменения

source: Missing data for 'token' file.
cs: Chybí data pro soubor s tokenem.
fr: Données manquantes pour le fichier « jeton ».
hu: Hiányoznak a "token" fájl adatai.
ru: Отсутствуют данные для файла токена.
sk: Chýbajúce dáta pre súbor s tokenom.

source: Cannot add remote device token. Check if device is already added.
cs: Nelze přidat token vzdáleného zařízení. Zkontrolujte, zda už zařízení nebylo přidáno.
fr: Impossible d’ajouter un jeton de périphérique distant. Vérifiez si le périphérique est déjà ajouté.
hu: Nem lehet hozzáadni a távoli eszköz tokent. Ellenőrizze, hogy az eszköz már hozzá van-e adva.
ru: Невозможно добавить токен удаленного устройства. Проверьте, если устройство уже добавлено.
sk: Token vzdialeného zariadenia sa nedá pridať. Skontrolujte, či zariadenie už nie je pridané.

source: Cannot delete device.
cs: Nelze smazat zařízení.
fr: Impossible de supprimer l'appareil.
hu: Az eszköz nem törölhető.
ru: Невозможно удалить устройство.
sk: Zariadenie sa nedá vymazať.

source: Missing data for "options" or "enabled" field.
cs: Chybí data pro pole "volby" nebo "povoleno".
fr: Données manquantes pour le champ "options" ou "enabled".
hu: Hiányoznak az "opciók" vagy az "engedélyezve" mező adatai.
ru: Отсутствуют данные для «опций» или «включенных» полей.
sk: Chýbajúce dáta pre polia „voľby“ alebo „povolené“.

source: Name is too long. Maximum 30 characters are allowed.
cs: Název je příliš dlouhý. Je povoleno maximálně 30 znaků.
fr: Le nom est trop long. Le nombre de caractères est de 30 maximum.
hu: A név túl hosszú. Legfeljebb 30 karakter megengedett.
ru: Имя слишком длинное. Допускается максимум 30 символов.
sk: Názov je príliš dlhý. Maximum je 30 znakov.

source: Cannot update device.
cs: Nelze aktualizovat zařízení.
fr: Impossible de mettre à jour le périphérique.
hu: Az eszköz nem frissíthető.
ru: Не удается обновить устройство.
sk: Zariadenie sa nedá aktualizovať.
